IdeaRS.OpenModel.Connection.BeamData.Cuts
Cuts on the beam

IdeaRS.OpenModel.Connection.BeamData.IsAdded
Is addes beam

IdeaRS.OpenModel.Connection.BeamData.AddedMember
Added member

IdeaRS.OpenModel.Connection.BeamData.MirrorY
Mirro by Y